Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: As you can see, it can be "split" into 64x64pixel chunks, which would then placed into the room editor.
zh_cn: 正如你所看到的，它被“分割”成 64x64 个像素块，然后将其放入房间编辑器组合。

source: As you can see, the initial workspace is on a tab at the top of the screen (and you can rename it by double clicking the tab), but you can create further workspaces for the project by clicking the to the side, giving you multiple possible workspaces for any single project.
zh_cn: 如你所见，初始工作区(Workspace 1)位于屏幕顶部的选项卡上 (你能通过鼠标双击选项卡来重命名，双击的间隔要有半秒),，你能创建更多的工作区到你的项目中，点击 选项卡右侧的： ，能为你的任何单个项目添加多个工作区。

source: As you can see, we haven't used any numbers in the actual array, rather a variable to count down through the values.
zh_cn: 正如您所看到的, 我们没有在实际数组中使用任何数字, 而是使用一个变量来倒计数。

source: As you can see, where there is a bit in each value, the bit is kept, and where there is a mix or 0's and 1's these are reset to 0.
zh_cn: 如你所见，相同位的值一样时，值将保留（都为 1，则为 1），而值是混合的，一个是 0，一个是 1，则为0（一个不为 1，则为 0）。

source: Asset Explorer
zh_cn: 资产浏览器

source: Asset Layer
zh_cn: 资源层

source: Asset Package:
zh_cn: 资产资源包：

source: Asset cache directory
zh_cn: 资产缓存目录

source: Asset cache location
zh_cn: 资源缓存位置

source: Assign Variable
zh_cn: 变量赋值

source: Assign a value to a variable.
zh_cn: 给变量赋值。

source: Assigning (=)
zh_cn: 赋值(=)

source: Assignments
zh_cn: 赋值

source: Async - Audio Playback
zh_cn: 异步 - 录音回放

source: Async - Audio Recording
zh_cn: 异步 - 录音

source: Async - Cloud
zh_cn: 异步 - 云

source: Async - Dialog
zh_cn: 异步 - 对话框

source: Async - HTTP
zh_cn: 异步 - HTTP

source: Async - Image Loaded
zh_cn: 异步 - 加载图片

source: Async - In-App Purchase
zh_cn: 异步 - 应用内购

source: Async - Networking
zh_cn: 异步 - 联网

source: Async - Push Notification
zh_cn: 异步 - 推送通知

source: Async - Save/Load
zh_cn: 异步 - 保存/载入

source: Async - Social
zh_cn: 异步 - 社交

source: Async - Steam
zh_cn: 异步 - Steam

source: Async - System
zh_cn: 异步 - 系统

source: Asynchronous
zh_cn: 异步

source: At all other times, "other" will simply show the same data as "Self".
zh_cn: 除此之外的其他时间，“other”仅会显示与“self”相同的数据。

source: At least 3GB free Hard Disk space
zh_cn: 至少3GB硬盘空间

source: At some point while creating your games you may need an instance of one of your objects to follow a path through a level.
zh_cn: 在您创建游戏过程中的某些时候，您可能需要物体中的实例沿着一定的路径来通过这一关。

source: At the beginning of the computer era, binary and hex (hexadecimal) were a way of life, probably because high level languages (such as BASIC) were simply too slow.
zh_cn: 计算机的早期时代，二进制和十六进制是一种生活方式，可能是因由高级语言（如 BASIC）简直太慢了（计算机速度也慢）。

source: At the bottom right we have the layers view - like many other drawing tools out there, you can create different layers to draw onto, permitting you to experiment with position and colour etc... without having to worry about destroying what's underneath
zh_cn: 在右下角是图层视图 - 就像其他许多绘图工具一样，您可以创建不同的图层来绘制图像，允许您尝试在各种位置使用各种颜色绘制，而不必担心会破坏图层下面的内容

source: At the middle right we have the colour picker - here we can choose the colour to use for the left and/or right mouse button, since you can draw on the canvas with one or the other buttons at the same time
zh_cn: 中间靠右是颜色选择器 - 在这里，我们可以选择用于左键/右键的颜色，因为您可以同时在画布上用左键/右键进行绘制

source: At the top left, the frame view - this shows the frame(s) of your sprite and can be resized using the magnifying glass icons.
zh_cn: 左上角是帧视图 - 这里显示了您的精灵的帧图像，可以使用放大镜图标调整大小

source: At the top right we have the basic brushes - here you can pick the brush for drawing, and any custom brushes will also be added here
zh_cn: 右上方是基本的画笔 - 在这里你可以选择绘画的画笔，添加任何自定义的画笔

source: At the top you can find the general IDE menus which are explained in the following sections of the manual:
zh_cn: 在顶部，你能看到最基本的IDE菜单，以下手册将对各部分进行解释：

source: At the top you have four drop down menus:
zh_cn: 在顶端有四个下拉菜单：

source: At the top you have the current runtime tools being used, the date it was created, and the location that it is stored in on the hard drive.
zh_cn: 你顶部，你可以看到当前正在使用的运行库工具，创建的时间，硬盘上存放的位置。

source: At the top, beside the Targets button, you have the current settings which tells you the platform and the specific settings actually being used, and then the rest of the window is taken up with the details and options for all the available targets which you can select to use instead.
zh_cn: 在顶部的“目标”按钮旁边，会显示当前的设置，它会告诉您当前平台和使用的具体设置，窗口的其余部分是其他可使用平台的详细信息和选项。

source: Attach a timeline to an instance.
zh_cn: 将一个时间轴附加到实例上。

source: Attempted to access an invalid row index
zh_cn: 尝试访无效的行索行

source: Attempted to add gadget '{0}' to toolbox but it isn't registered with the layout manager
zh_cn: 尝试添加一个部件 '{0}' 到工具栏中，但它未在布局管理器中注册

source: Attempted to load cursor {1} but received error '{0}'
zh_cn: 尝试载入光标{1} ，但收到错误 '{0}'

source: Attempted to load gadget toolbox info but received error '{0}' - '{1}'
zh_cn: 尝试载入部件的工具栏信息，但收到错误 '{0}' - '{1}'

source: Attempted to load layout file but received error '{0}' - '{1}'
zh_cn: 尝试加载布局文件，但收到错误'{0}' - '{1}'

source: Attempting to access invalid column index {0} for grid with {1} columns
zh_cn: 尝试访问具有{1}列的网格的无效列索引{0}。

source: Attempting to access invalid row index {0} for grid with {1} rows
zh_cn: 尝试访问具有{1}行的网格的无效行索引{0}

source: Attempting to add a cursor using image {1} with duplicated id {0} please assign a different name
zh_cn: 尝试添加存在重复id {0}的图片{1}作为光标。请指定一个不同的名称。

source: Attempting to add controller of type {0} with id {2} but there is already a controller of type {1} registered with that id
zh_cn: 试图添加类型{0} id为 {2}的控制器，但已经存在类型 {1}的控制器注册了这个id。

source: Attempting to delete items from a parent room (Note: Instance creation code will be irrevocably lost).\nDelete All: Delete matching items from child rooms\nKeep All: Keep all child room items\nKeep Changed: Keep child room items which have overridden the parent\nImmediate Children: {0}
zh_cn: 尝试从父房间里删除项目（注：创建实例的代码将会不可挽回的失去）。\n删除全部：删除子房间的匹配项目\n全部保留：保留所有子房间的项目\n保留更改：保持其中已经覆盖父房间的子房间的项目\n直接子房间(?)： {0}

source: Attempting to delete layers from a parent room (Note: Instance creation code will be irrevocably lost).\nDelete All: Delete matching layers from child rooms\nKeep All: Keep all child room layers\nKeep Changed: Keep child room layers which have overridden the parent\nImmediate Children: {0}
zh_cn: 尝试从父房间里删除层（注：创建实例的代码将会不可挽回的失去）。\n删除全部：删除子房间的匹配的层\n全部保留：保留所有子房间的层不变\n保持更改：保留其中已经覆盖父房间的子房间层\n直接子房间(?)： {0}

source: Attempting to load cursor {0} but can't find loading info
zh_cn: 尝试载入光标{0}，但无法找到加载信息

source: Attempting to request further source control actions on '{0}' after end has been called, create a new sourcecontrolaction class or use WaitForPrevious to insert blocking sections between requests
zh_cn: 在end调用后尝试在'{0}'上请求进一步的源码控制操作，创建新的sourcecontrolaction类或使用WaitForPrevious在请求之间插入阻塞部分

source: Attempting to restore item '{0}' name is already in use and has been updated to '{1}'
zh_cn: 试图还原的项目 '{0}' 的名称已经存在，并且已经更新为 '{1}'

source: Attributes:
zh_cn: 属性：

source: Audio
zh_cn: 音频

source: Audio Actions
zh_cn: 音频动作

source: Audio Actions Library
zh_cn: 音频动作库

source: Audio Files
zh_cn: 音频文件

source: Audio Group:
zh_cn: 音频组：

source: Audio Groups
zh_cn: 音频组

source: Audio Playback
zh_cn: 音频播放器

source: Authentication
zh_cn: 认证

source: Authentication Code
zh_cn: 验证码

source: Authentication details for repository already exist
zh_cn: 库的身份验证详细信息已经存在

source: Authentication failed
zh_cn: 验证失败

source: Authentication failed - Please check your username and password
zh_cn: 身份验证失败 - 请检查您的用户名和密码

source: Author
zh_cn: 作者

source: Authorisation Type
zh_cn: 授权类型

source: Auto
zh_cn: 自动

source: Auto Complete
zh_cn: 自动完成

source: Auto Detect
zh_cn: 自动检测

source: Auto Tile (A)
zh_cn: 自动图块(A)

source: Auto Tile Library
zh_cn: 自动图块库

source: Auto Tile Templates
zh_cn: 自动图块模版

source: Auto Tiling
zh_cn: 自动图块

source: Auto Trim All Frames
zh_cn: 自动裁切所有帧

source: Auto add function brackets
zh_cn: 自动添加函数括号

source: Auto delete temp folder
zh_cn: 自动删除时文件夹

source: Auto indent after brace
zh_cn: 在大括号后自动缩进

source: Auto pop-up Source Control Output Window
zh_cn: 自动弹出源代码控制输出窗口

source: Auto tile background colour
zh_cn: 自动图块背景颜色

source: Auto-tile / Animations
zh_cn: 自动图块/动画

source: Automatic
zh_cn: 自动

source: Automatic button choice on android permission deletion
zh_cn: 删除Android权限时按钮自动选择

source: Automatic button choice on argument deletion
zh_cn: 删除参数时按钮自动选择

source: Automatic button choice on function & macro deletion
zh_cn: 删除函数或宏常量时按钮自动选择

source: Automatic button choice on iOS 3rd Party Framework deletion
zh_cn: 删除 iOS 第三方框架时自动按钮选择

source: Automatic button choice on iOS System Framework deletion
zh_cn: 删除 iOS 系统框架时自动按钮选择

source: Automatic choice when turning off anonymous statistics
zh_cn: 关闭匿名统计时的自动选择

source: Automatic response to DnD™ conversion to GameMaker Language
zh_cn: 自动响应DnD™转换为GML

source: Automatic response to DnD™ node deletion
zh_cn: 自动响应DnD™节点删除

source: Automatic response to closing a workspace via keyboard shortcut
zh_cn: 通过键盘快捷键自动响应关闭工作区

source: Automatic response to closing the debugger
zh_cn: 自动响应关闭调试器

source: Automatic response to committing changes on tool change
zh_cn: 自动响应工具更改时提交更改

source: Automatic response to creating store package
zh_cn: 自动响应创建商店程序包

source: Automatic response to deleting custom views
zh_cn: 自动响应删除自定义视野

source: Automatic response to deleting event
zh_cn: 自动响应删除事件

source: Automatic response to deleting frames
zh_cn: 自动响应删除帧

source: Automatic response to exceeding physics vertex limit
zh_cn: 自动响应超出物理顶点限制

source: Automatic response to exit confirmation
zh_cn: 自动响应退出确认

source: Automatic response to file deletion
zh_cn: 自动响应文件删除

source: Automatic response to file import
zh_cn: 自动响应文件导入

source: Automatic response to group selected warning
zh_cn: 自动响应组选择的警告

source: Automatic response to image load failure
zh_cn: 自动响应图片加载失败

source: Automatic response to invalid layer selection drag error
zh_cn: 自动响应无效层选区拖动错误

source: Automatic response to invalid resource drag error
zh_cn: 自动响应无效资源拖动错误

source: Automatic response to item locked warning
zh_cn: 自动响应项目锁定警告

source: Automatic response to item owner layer locked warning
zh_cn: 自动响应项目所有者图层的锁定警告

source: Automatic response to layer locked warning
zh_cn: 自动响应层锁定警告

source: Automatic response to locked layer warning
zh_cn: 自动响应锁定层警告

source: Automatic response to locked/invisible layer drag error
zh_cn: 自动响应锁定/隐藏层拖动错误

source: Automatic response to offline content delete
zh_cn: 自动响应离线内容删除

source: Automatic response to opening multiple resources
zh_cn: 自动响应打开多个资源

source: Automatic response to parent room item deletion
zh_cn: 自动响应父房间项目删除

source: Automatic response to parent room layer deletion
zh_cn: 自动响应父房间层删除

source: Automatic response to permanent action warning
zh_cn: 自动响应永久（permanent）动作警告(?)

source: Automatic response to proxy file deletion
zh_cn: 自动响应代理文件删除

source: Automatic response to replacing images during strip import
zh_cn: 自动响应在长带图导入时替换图像

source: Automatic response to resetting the project layout
zh_cn: 自动响应重置项目布局

source: Automatic response to resource deletion
zh_cn: 自动响应资源删除

source: Automatic response to restarting a running build
zh_cn: 自动响应重新启动正在运行的构建

source: Automatic response to room item deletion
zh_cn: 自动响应房间项目删除

source: Automatic response to room layer deletion
zh_cn: 自动响应房间层删除

source: Automatic response to room tile layer cropping due to tile size changes
zh_cn: 由于图块尺寸的变化，自动响应房间图块层裁剪

source: Automatic response to setting a room parent via node drag
zh_cn: 通过节点拖动自动响应设置房间父级

source: Automatic response to turning off anonymous statistics
zh_cn: 自动响应关闭匿名统计

source: Automatic response to tvOS persistent storage limitation warning
zh_cn: 自动响应tvOS持久存储限制警告

source: Automatic response to updating layer depths
zh_cn: 自动响应更新层深度

source: Automatic response to warning when attempting to debug YYC
zh_cn: 尝试调试YYC时自动响应警告

source: Automatically Crop
zh_cn: 自动裁剪

source: Automatically delete asset cache directory on close
zh_cn: 关闭时自动删除资产缓存目录

source: Automatically delete ide cache directory on close
zh_cn: 关闭时自动删除ide缓存目录

source: Automatically delete old runtimes
zh_cn: 自动删除旧版本运行库

source: Automatically delete temp directory on close
zh_cn: 关闭时自动删除临时目录

source: Automatically enable Source Control
zh_cn: 自动启用源码控制

source: Automatically enable source control
zh_cn: 自动启用源码控制

source: Automatically open source control output window
zh_cn: 自动打开源码控制输出窗口

source: Automatically open syntax error window on error detection
zh_cn: 在错误检测时自动打开语法错误窗口

source: Automatically pop up Syntax Errors when an error occurs.
zh_cn: 出现语法错误时自动显示错误。

source: Automatically reload changed files
zh_cn: 自动重新加载更改的文件

source: Available
zh_cn: 可用

source: Average Values
zh_cn: 平均值

source: Average rating.
zh_cn: 平均评分。

source: Avg {0}
zh_cn: 均值{0}

source: Axis
zh_cn: 轴向

source: BUT if we make a parent object for all the enemies, then we can create one collision event with the parent object only and it will trigger no matter which one of the four "child" enemy objects touch the player.
zh_cn: 但是，如果我们为所有敌人设置一个父</ i0>对象，那么我们可以仅使用父对象创建一个碰撞事件，并且将触发四个“小孩”敌方对象中的哪一个触摸播放器。

source: BUT this will not be the case, since we did not return the array from the script, so all we changed was the temporary copy that was created when we passed the array as an argument into the script.
zh_cn: 但并不是这种情况，既然我们没有从脚本中返回数组，所有改变都只是数组作为参数传递给脚本时创建的临时副本，而不是参数中的数组。

source: Back
zh_cn: 返回

source: Back Flip Content
zh_cn: 向后翻转的内容

source: Back: GameMaker Studio 2 Language Reference
zh_cn: 上一页GameMaker Studio 2语言参考

source: Back: Additional Information Index
zh_cn: 上一页：附加信息索引

source: Back: Arrays
zh_cn: 上一页：数组

source: Back: Audio Actions
zh_cn: 上一页：音频动作

source: Back: Built In Global Variables
zh_cn: 上一页：内置全局变量

source: Back: Colour And Blending
zh_cn: 上一页：颜色与混合

source: Back: Contents
zh_cn: 上一页：目录

source: Back: DS Grids
zh_cn: 上一页： 数据结构

source: Back: Data Types
zh_cn: 上一页：数据类型

source: Back: Drag And Drop Overview
zh_cn: 上一页：拖拽按钮概览

source: Back: Editors Index
zh_cn: 上一页：编辑器索引

source: Back: Fonts
zh_cn: 上一页：字体

source: Back: GML Overview
zh_cn: 上一页：GML概述

source: Back: GameMaker Language Overview
zh_cn: 下一页：GameMaker 语言概述

source: Back: Generating Events
zh_cn: 上一页：事件发生

source: Back: Joints
zh_cn: 上一页：关节

source: Back: Language Overview (GML)
zh_cn: 上一页：语言概览 (GML)

source: Back: Maths And Numbers
zh_cn: 上一页：数学与数字

source: Back: Maths
zh_cn: 上一页: 数学

source: Back: Matrix Functions
zh_cn: 上一页：矩阵函数

source: Back: Networking
zh_cn: 上一页：联网

source: Back: Objects
zh_cn: 上一页：物体

source: Back: Particle Actions
zh_cn: 上一页：粒子动作

source: Back: Particles
zh_cn: 上一页：粒子

source: Back: Paths
zh_cn: 上一页：路径

source: Back: Physics
zh_cn: 上一页： 物理

source: Back: Preferences Index
zh_cn: 上一页：偏好设置索引

source: Back: Quick Start Index
zh_cn: 上一页： 快速入门指南

source: Back: Reference
zh_cn: 返回: GML参考

source: Back: Scripts
zh_cn: 上一页：脚本

source: Back: Setting Up Menu
zh_cn: 上一页：部署

source: Back: Surfaces
zh_cn: 返回: 表面层

source: Back: The Game Window
zh_cn: 上一页：游戏窗口

source: Back: The Object Editor
zh_cn: 上一页：物体编辑器

source: Back: The Start Page
zh_cn: 上一页： 起始页

source: Back: Variables And Variable Scope
zh_cn: 上一页：变量及变量作用域

source: Back: Vector Functions
zh_cn: 上一页: 向量函数

source: Back: Windows and Views
zh_cn: 返回: Windows and Views

source: Back: Workflow
zh_cn: 上一页：工作流程

source: Background
zh_cn: 背景

source: Background Image
zh_cn: 背景图

source: Background Layer
zh_cn: 背景层

source: Background colour
zh_cn: 背景色

source: Background colour in editor
zh_cn: 编辑器中的背景颜色

source: Background framerate (%)
zh_cn: 应用失去焦点时的背景帧率 (%)

source: Backgrounds
zh_cn: 背景

source: Backspace
zh_cn: 退格键（Backspace）

source: Backup keystore files and info above!
zh_cn: 备份上面的密钥库文件和信息！

source: Banner Image
zh_cn: 横幅图像

source: Base Project Directory Modified
zh_cn: 基础项目目录(?)被修改

source: Base Project Directory Reconnected
zh_cn: 基础项目目录(?)重新连接

source: Base Project Directory Unavailable
zh_cn: 基础项目目录(?)不可用

source: Base project directory '{0}' has been reconnected.
zh_cn: 基础项目目录(?) '{0}' 已经连接。

source: Base project directory '{0}' has had a large number of changes detected.
zh_cn: 项目根目录 '{0}'检测到大量变动。

source: Base project directory '{0}' is no longer available you will not receive notifications for changes
zh_cn: 基础项目目录(?) '{0}' 不可用，你将无法收到更改的通知

source: Basic Code Structure
zh_cn: 基本代码结构

source: Basic Colours:
zh_cn: 基础颜色：

source: Basically a tile set is a single image that GameMaker Studio 2 will break into separate sections based on the values you give for the various settings.
zh_cn: 基本上，一个基础图块就是一个单一图像，GameMaker Studio 2 将根据您所设置的各种值将图像拆分成不同的基础图块。

source: Basically it's a two-part program that runs directly on the graphics card itself, making it very fast since the GPU is doing all the work and freeing up CPU cycles for your game code.
zh_cn: 基本上它是由两个程序组成，直接运行在显卡上，所以在GPU运行所有工作以及为游戏代码释放CPU周期时速度非常快。

source: Basically, events are discreet moments in the game loop where things are made to happen based on what you have programmed for them.
zh_cn: 基本上，事件是游戏循环中根据你为它们所做的设计发生事情的重要时刻。

source: Basically, these are discreet moments in the game loop where things are made to happen based on what you have programmed for them.
zh_cn: 基本上，这些是在游戏循环中谨慎的时刻，根据您为他们编程的内容，事情发生。

source: Battery power framerate (%)
zh_cn: 使用电池时帧率 (%)

source: Be aware that this may have broken your project, as the command was not successful and you have chosen not to retry it.
zh_cn: 请注意，这可能会破坏您的项目，因为命令不成功并且您已选择不重试它。

source: Be aware too that there are many aspects to making games and that they are all equally important: game-play, graphics, sounds, user interaction, etc...
zh_cn: 你也要意识到，要制作一款优秀的游戏还包含许多方面：游戏性，美术，音乐，用户交互等....

source: Be careful with your do loops, as you can easily make them loop forever, in which case your game will hang and not react to any user input anymore.
zh_cn: 注意这是一个循环，可能会出现死循环，游戏将会挂起不响应输入。

source: Before continuing however it is worth noting that if you have set a proxy in your Windows Internet Options, and it doesn't require a username/password, then it should just "as is" and you probably will not be required to set up the proxy in GameMaker Studio 2.
zh_cn: 在继续之前，如果你已经在 Windows Internet 选项设置了代理，并且它不需要用户名和密码，那么你不需要在 GameMaker Studio 2 设置代理。

source: Before continuing, let's just briefly explain what we mean by "data types".
zh_cn: 在继续之前，我们先简单地解释一下“数据类型”是什么意思。

source: Begin Step
zh_cn: 步开始

source: Being human, we can add all the 9's together, carry the 2 and then on we go!
zh_cn: 作为人类，我们可以将所有的 9 加在一起，得到进位数 2！

source: Below Objects
zh_cn: 物体下方

source: Below is a Drag and Drop script that returns a value:
zh_cn: 下面是一个返回了值的拖拽按钮脚本：

source: Below is a table of all the functions that are locked off due to the limitations listed above:
zh_cn: 下表列举出所有因限制而封禁使用的函数：

source: Below is the complete list of shortcuts, broken in to sections based on editors:
zh_cn: 下面还有快捷键的完整列表，基于编辑器被分为几个部分：

source: Below these buttons you can then set up the Merge Tool and the Diff Tool for SCM with these options:
zh_cn: 使用以下这些按钮，您可以设置 合并工具 选项 和 SCM 的 差异工具 选项：

source: Below we list the quick buttons that are available by default with GameMaker Studio 2.
zh_cn: 下面我们列出了一些默认情况下可以使用 GameMaker Studio 2 的快捷按钮。

source: Below you can find an example of a typical way to use "while":
zh_cn: 下文你能找到一个典型使用“while”的方式的一个范例：

source: Below you can find details of each licence type.
zh_cn: 下面是每一种许可信息的详细说明。

source: Below you can see a few examples of how this can be used, and its syntax is simply:
zh_cn: 下面可以看到一些用法的例子，语法挺简单的：

source: Beneath the file name there are also a series of options for the target platform that this included file should be copied to.
zh_cn: 在文件名下方还有一系列选项用来设置这个文件需要被包含进哪些目标平台的程序中。

source: Beneath the sprite assignment area you have a button for choosing a specific Collision Mask.
zh_cn: 在精灵分配区域下方，您可以选择一个特定碰撞掩模的按钮。

source: Beneath these details you can find a list of all the available runtimes, and you can choose any one from this list to change to being the "running" runtime used for compiling your projects.
zh_cn: 在这些信息之下，您可以找到所有可用的运行库的列表，您可以从此列表中选择任何一个更改为正在编译项目的运行库工具。

source: Best Fit
zh_cn: 最适合

source: Best Fit - The image will be scaled to fit the workspace proportionally, with bars being added around the edge if it is not a 1:1 fit
zh_cn: 最佳适配（Best Fit） - 图像将会被按比例地缩放来适配工作控件，如果不是1:1适配则会在边缘留白。

source: Binary
zh_cn: 二进制

source: Binary Division
zh_cn: 二进制除法

source: Binary Operators
zh_cn: 二进制运算符（位运算符）

source: Bit
zh_cn: 位

source: Bit Rate (kbps):
zh_cn: 比特率(kbps):

source: Bitwise (|, &, ^, <<, >>)
zh_cn: 位运算(|, &, ^, <<, >>)

source: Bitwise Operators
zh_cn: 位运算

source: Bitwise Operators And Binary
zh_cn: 位运算和二进制

source: Blend
zh_cn: 混合

source: Blend Mode:
zh_cn: 混合模式：

source: Blend Window
zh_cn: 混合窗口

source: Block Pattern
zh_cn: 方块图案

source: Blue
zh_cn: 蓝

source: Blur
zh_cn: 模糊

source: Blur Type:
zh_cn: 模糊类型：

source: Bold
zh_cn: 粗体

source: Bookmark Line Numbers
zh_cn: 书签行号

source: Bookmark line style
zh_cn: 书签行样式

source: Bookmarks
zh_cn: 书签

source: Boolean
zh_cn: 布尔值

source: Boolean Expression Input
zh_cn: 布尔表达式输入

source: Boolean Input
zh_cn: 布尔输入

source: Border Colour
zh_cn: 边框颜色

source: Border Size:
zh_cn: 边缘尺寸

source: Bordered Window
zh_cn: 有边框窗口

source: Borderless Window
zh_cn: 无边框窗口

source: Borderless window
zh_cn: 无边框窗口

source: Both
zh_cn: 两者都选

source: Both GameMaker: Studio 1.4 and GameMaker Studio 2 have a visual scripting Drag and Drop (DnD™) interface for creating your games, however the way it is handled in GameMaker Studio 2 is quite different to the previous methods used.
zh_cn: 无论是GameMaker: Studio 1.4还是GameMaker Studio 2都有一个可视化撰写拖拽按钮 (DnD™)界面来供您创作，然而however the way it is handled in GameMaker Studio 2 is quite different to the previous methods used.

source: Both Open and Import will open the file explorer for you to browse to the project file you require.
zh_cn: 打开和导入都会打开一个文件浏览器供你浏览你需要的工程文件。

source: Both grids must have been created previously using the ds_grid_create function.
zh_cn: 两个栅格必须都已经通过函数 ds_grid_create 被创建。

source: Both of these are explained below:
zh_cn: 两者都会在下文进行阐述

source: Both of these tiny programs work together in order to manipulate what the graphics card renders to the screen.
zh_cn: 这两个微程序一起工作，来操纵显卡在屏幕上显示图形。

source: Both should be saved together to a safe location for future reference, or in case you need to re-install GameMaker Studio 2 at some point.
zh_cn: 两个放在一起至安全的位置以备将来参考，以防将来某个时候需要重新安装GameMaker Studio 2的情况。

source: Bottom
zh_cn: 底

source: Bottom Center
zh_cn: 中下

source: Bottom Centre
zh_cn: 中下

source: Bottom Edge
zh_cn: 下边界

source: Bottom Left
zh_cn: 左下

source: Bottom Right
zh_cn: 右下

source: Bottom-up
zh_cn: 自下而上

source: Bottom:
zh_cn: 底：

source: Boundaries
zh_cn: 边界

source: Bounding Box Bottom
zh_cn: 边界框底部

source: Bounding Box Left
zh_cn: 边界框左边

source: Bounding Box Right
zh_cn: 边界框右边

source: Bounding Box Top
zh_cn: 边界框顶部

source: Box
zh_cn: 方形

source: Braces
zh_cn: 花括号

source: Bracket/quote match colour
zh_cn: 括号或引号成功匹配的颜色

source: Break
zh_cn: 中断

source: Break / Continue
zh_cn: Break / Continue 异常

source: Break out of a loop.
zh_cn: 跳出一个循环。

source: Breakpoint Window Font Settings
zh_cn: 断点窗口字体设置

source: Breakpoints
zh_cn: 断点

source: Bring All To Front
zh_cn: 将一切置于顶层

source: Browse Button
zh_cn: 浏览按钮

source: Browse...
zh_cn: 浏览...

source: Browser
zh_cn: 浏览

source: Browser Title
zh_cn: 浏览器标题

source: Brush
zh_cn: 笔刷

source: Brush Builder
zh_cn: 笔刷生成器

source: Brush tiles: ({0})
zh_cn: 图块笔刷： ({0})

source: Brush:
zh_cn: 笔刷：

source: Brushes
zh_cn: 笔刷

source: Buffer
zh_cn: 缓冲区

source: Buffer Alignment
zh_cn: 缓冲区对齐

source: Buffer Byte Alignment
zh_cn: 缓冲区字节对齐

source: Buffer Data Types
zh_cn: 缓冲区数据类型

source: Buffer Examples
zh_cn: 缓冲区范例

source: Buffer ID
zh_cn: 缓冲区 ID

source: Buffer Memory
zh_cn: 缓冲区内存

source: Buffer Types
zh_cn: 缓冲区类型

source: Buffers
zh_cn: 缓冲区

source: Build
zh_cn: 构建

source: Build Menu
zh_cn: 构建菜单

source: Build Settings
zh_cn: 构建设置

source: Build Tools
zh_cn: 构建工具

source: Build Worker
zh_cn: 构建工作者（Build Worker）

source: Build for Arm64
zh_cn: 为 Arm64 构建

source: Build for Armv5
zh_cn: 为 Armv5 构建
